src/test/resources/templates/iso/tar-valid.xml

<soapenv:Envelope xmlns:soapenv="http://schemas.xmlsoap.org/soap/envelope/" xmlns:iso="http://www.firstdata.com/">
    <soapenv:Header/>
    <soapenv:Body>
        <iso:tar>
            <pan>${pan}</pan>
            <panExpiryDate>${panExpiryDate}</panExpiryDate>
            <terminalId>${terminalId}</terminalId>
            <acceptorId>${acceptorId}</acceptorId>
            <acceptorName>${acceptorName}</acceptorName>
            <correlationId>${correlationId}</correlationId>
            <tokenAction>${tokenAction}</tokenAction>
            <tokenRequestorId>${tokenRequestorId}</tokenRequestorId>
            <tokenRequesterType>${tokenRequesterType}</tokenRequesterType>
            <deviceName>${deviceName}</deviceName>
            <path>${path}</path>
        </iso:tar>
    </soapenv:Body>
</soapenv:Envelope>
